app/controllers/index_controller.rb

SELECT * FROM `news` ORDER BY news.id DESC LIMIT 1
---
  def news
    @news = News.all

SELECT * FROM `news`
---
  def wszystkienewsy
    @news = News.all

INSERT INTO `news` (`tytul`, `tresc`, `data`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, '2010-06-23 08:18:40', '2010-06-23 08:18:40')
---
  def dodajnews
    @news = News.new(params[:news])
    if request.post?
      @news.data = Time.now
        @news.save

SELECT * FROM `ksiegas`
---
  def ksiegagosci
    @ksiega = Ksiega.all

INSERT INTO `ksiegas` (`user`, `tresc`, `data`, `student`, `created_at`, `updated_at`) VALUES('Blalalaa', 'aasdasdasdasdasdasdasdas', '2010-06-23 17:54:26', x'30', '2010-06-23 15:54:26', '2010-06-23 15:54:26')
---
  def dodajwpis
    @ksiega = Ksiega.new(params[:ksiega])
    if request.post?
      @ksiega.data = Time.now
        @ksiega.save